In [1]:
data = {"ID" : [1,2,3,4,5] , "Name" : ["mohammad" , "ahmed" , "ali" , "sayed" , "mazen"] , "Dept" : ["CS" , "IT" , "DS" , "IS" ,"CS"]}

In [3]:
data

{'ID': [1, 2, 3, 4, 5],
 'Name': ['mohammad', 'ahmed', 'ali', 'sayed', 'mazen'],
 'Dept': ['CS', 'IT', 'DS', 'IS', 'CS']}

In [4]:
import pandas as pd 
import numpy as np

In [5]:
data_frame = pd.DataFrame(data)

In [6]:
data_frame

   ID      Name Dept
0   1  mohammad   CS
1   2     ahmed   IT
2   3       ali   DS
3   4     sayed   IS
4   5     mazen   CS

In [8]:
data_frame.head()

   ID      Name Dept
0   1  mohammad   CS
1   2     ahmed   IT
2   3       ali   DS
3   4     sayed   IS
4   5     mazen   CS

In [9]:
info = {'one' : pd.Series([1, 2, 3, 4, 5, 6], index=['a', 'b', 'c', 'd', 'e', 'f']),  
   'two' : pd.Series([1, 2, 3, 4, 5, 6, 7, 8], index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])}

In [10]:
info

{'one': a    1
 b    2
 c    3
 d    4
 e    5
 f    6
 dtype: int64,
 'two': a    1
 b    2
 c    3
 d    4
 e    5
 f    6
 g    7
 h    8
 dtype: int64}

In [11]:
data_frame_2 = pd.DataFrame(info)

In [12]:
data_frame_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  6.0    6
g  NaN    7
h  NaN    8

In [13]:
data_frame_2.head()

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5

In [21]:
data_frame_2 = data_frame_2.drop("Three" , axis = 1)

In [22]:
data_frame_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  6.0    6
g  NaN    7
h  NaN    8

In [23]:
data_frame_2["sum"] = data_frame_2.one + data_frame_2.two

In [24]:
data_frame_2

   one  two   sum
a  1.0    1   2.0
b  2.0    2   4.0
c  3.0    3   6.0
d  4.0    4   8.0
e  5.0    5  10.0
f  6.0    6  12.0
g  NaN    7   NaN
h  NaN    8   NaN

In [25]:
del data_frame_2['sum']

In [26]:
data_frame_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  6.0    6
g  NaN    7
h  NaN    8

In [27]:
data_frame_2

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  6.0    6
g  NaN    7
h  NaN    8